# %%
import matplotlib.pyplot as plt


# 図の中心座標とスケルトンデータ
joints = {
    "torso": [(0, 0), (0, 1)],
    "left_arm": [(0, 1), (-1, 2), (-1.5, 2.5)],
    "right_arm": [(0, 1), (1, 2), (1.5, 2.5)],
    "left_leg": [(0, 0), (-0.5, -1), (-0.75, -1.5)],
    "right_leg": [(0, 0), (0.5, -1), (0.75, -1.5)],
}

# リムのペア
limbs = [
    (0, 1), (1, 2), (1, 5),  # 中心軸
    (2, 3), (3, 4), (4, 8),  # 右脚
    (5, 6), (6, 7), (7, 9),  # 左脚
    (0, 12), (12, 15),       # 上半身
    (12, 17), (17, 18), (18, 19), (19, 20),  # 右腕
    (12, 14), (14, 16), (16, 21), (21, 22)   # 左腕
]

# 色
colors = [
    "#FF0000", "#FF0000", "#FF0000",  # 中心軸
    "#0000FF", "#0000FF", "#0000FF",  # 右脚
    "#00FF00", "#00FF00", "#00FF00",  # 左脚
    "#FFA500", "#FFA500",             # 上半身
    "#800080", "#800080", "#800080", "#800080",  # 右腕
    "#FFFF00", "#FFFF00", "#FFFF00", "#FFFF00"   # 左腕
]

# 各ジョイント間の色付けを適用してプロット
for limb, color in zip(limbs, colors):
    start, end = limb
    plt.plot([joints[start][0], joints[end][0]],
             [joints[start][1], joints[end][1]],
             color=color)
plt.show()

